# -*- coding: UTF-8 -*-

# Filename : b18_given_name.py
# author by : （学员ID)

# 要点：函数 + 元组
import sys
import io
import random

# 解决输出显示汉字乱码的问题
#sys.stdout = io.TextIOWrapper(sys.stdout.buffer,encoding='utf-8')
#print (sys.stdout.encoding)  # 确认当前的控制台显示字符的编码

# 建立一个函数，可以随机产生一个中国人的名称
def pick_given_name( is_boy ):
    # 男孩们的单字名
    boys_given_words1 = ( \
		'潮','彻','郴','琛','澈','臣','辰','晨','承','盛','程','池','炽','冲','重','崇','绸','畴','酬','筹', \
		'楚','处','棰','锤','淳','赐','聪','璁','丛','淙','琮','璀','村','达','大','代','岱','玳','单','郸', \
		'石','当','铛','党','祷','道','得','德','地','灯','登','迪','狄','笛','柢','递','谛','滇','巅','典', \
		'淀','雕','顶','鼎','东','栋','笃','度','端','缎','煅','锻','敦','铎','恩','发','法','凯','志','明', \
		'伟','嘉','建','文','子','云','杰','兴','友','才','振','航','鹏','宇','衡','佳','强','宁','丰','波', \
		'森','学','民','永','翔','鸿','海','军','贵','藏','操','焯','晁','朝','驰','川','义','生','凡','连', \
		'良','乐','勇','辉','龙','宏','安','岩','中','茂','进','林','有','诚','先','敬','震','正','涛','超', \
		'周','勋','元','哲','俊','博','彬','富','顺','信','昌','豪','邦','绍','浩','泽','涵','思','家','魄', \
		'檗','卜','步','埔','瓿','材','财','参','灿','策','曾','差','察','长','昶','畅','倡','绰','帆','藩', \
		'杠','巩','贡','钩','加','见','将','飞','斐','奋','风','枫','峰','烽','锋','逢','福','阜','复','奖', \
		'金','津','竟','靖','镜','镌','赋','盖','溉','概','甘','刚','岗','钢','罡','港','高','诰','革','葛', \
		'铬','根','庚','耿','功','宫','恭','构','故','顾','观','冠','莞','管','光','广','归','圭','桂','过', \
		'纪','技','系','季','际','继','绩','稷','谦','霆','玉','智','名','聚','兵','忠','廷','江','政','君', \
		'恒','礼','磊','阳','洋','迅','胜','传','创','存','锉','宕','导','岛','砥','斗','督','顿','瀚','瑞', \
		'朔','荣','为','斌','庆','成','可','健','英','锦','立','平','旭','同','全','源','向','雄','利','希', \
		'奇','易','来','启','坤','昊','朋','和','艺','昭','映','威','奎','帅','星','春','章','伦','城','钊', \
		'洲','晗','景','珂','皓','棠','越','语','钧','亿','基','理','纶','维','瑜','齐','毅','谊','贤','逸', \
		'卫','万','臻','儒','洁','霖','隆','远','耀','誉','岚','康','天','甲','价','驾','架','稼','尖','坚', \
		'间','俭','检','简','饯','剑','漳','谏','践','鉴','键','交','佼','皎','觉','教','阶','节','解','介', \
		'界','近','劲','晋','京','经','荆','径','竞','炯','赳','九','韭','居','驹','枸','举','巨','炬','隽', \
		'决','诀','均','郡','峻','浚','骏','竣','羽','韦'
    )
    # 男孩们的双字名
    boys_given_words2 = ( \
        '致浩','明云','浩烨','兆忠','予忻','顺雨','尚扬','俊祥','语禅','予浩','童兆','可然','业尚','抒霄','如海','聿彦','德容','政斌','羽凡','沛林', \
        '毅宾','晖予','运川','志双','程涵','英资','曦傲','誉冉','翊暄','兆博','梓楚','祖翰','轩睿','梓哲','偌宸','炜晁','宜书','以诺','睿思','开浩', \
        '峥延','灿烨','煜萧','亿鑫','家容','冬抒','谊言','凌宏','江哲','苛弈','名轩','涵蓄','卫洋','洪生','鸿森','霖祥','浩广','睿才','宇琪','华瑞', \
        '子櫲','羽希','梓灵','渤驰','圣彭','岩辉','寅升','思宇','艺喧','艳秋','汇然','楷荣','宁彦','韵沅','君戎','学竣','宇笑','俊曦','宸源','岳楠', \
        '予抒','尚寅','烨赫','宏旷','呈熙','祺然','俊麟','心逸','雨桐','晖尚','炳鑫','睿炯','智笙','毓珲','廷希','章宸','玉庭','震晗','梓瑾','文悦', \
        '士元','禹浩','凯文','兴睿','抒淯','煜烨','家燊','宏扬','笑书','烨毅','潇育','思博','德懿','慕鑫','意佳','子烨','奕洋','华铭','旭滕','昶旭', \
        '宇聪','鑫宇','桦烨','士忠','会钧','泓宁','名宁','子予','杰呈','懿敏','旭鸣','景森','钦瑞','萧宸','国欣','亭钧','恩曦','雄智','天叙','君昊', \
        '启纬','菁眙','龙辰','皓予','誉浛','华阳','成笑','鸣逸','阳越','疏鸣','巍续','瑞奇','羽翰','岳阳','秋智','永春','苛意','欣诺','铭亿','羽盈', \
        '有聪','珈毓','夙宸','致彬','佩誉','含烨','羽儒','志利','艺蕴','羽纤','世方','朗贤','睿芯','语阳','硕育','彦淳','美轩','峪含','浩玮','益含', \
        '泣涵','俊言','凇伯','梦熙','峻熙','胥宸','舞轩','书懿','智邦','源彬','炯抒','宇齐','睿珅','晨杰','高明','雨益','尚悦','晔尚','茗钦','雪山'  \
    )
    # 女孩们的单字名
    girls_given_words1 = ( \
        '叶','璐','娅','琦','晶','妍','瑶','毓','茜','秋','珊','莎','锦','黛','青','倩','婷','姣','婉','娴', \
        '颖','露','怡','婵','雁','蓓','纨','仪','荷','丹','蓉','眉','君','琴','蕊','薇','菁','岚','苑','婕', \
        '瑗','琰','韵','融','园','艺','咏','卿','聪','澜','纯','悦','昭','冰','爽','琬','茗','羽','希','宁', \
        '瑾','馨','欣','飘','育','滢','馥','筠','竹','霭','凝','晓','欢','霄','枫','芸','菲','寒','伊','亚', \
        '宜','可','柔','思','糖','雅','钰','嘉','芯','楚','沁','妃','岑','雯','允','萌','姿','予','卉','舒', \
        '诗','佳','姬','影','荔','枝','丽','秀','娟','英','华','慧','巧','美','娜','静','淑','惠','珠','翠', \
        '芝','玉','萍','红','娥','玲','芬','芳','燕','彩','春','菊','勤','珍','贞','莉','兰','凤','洁','梅', \
        '琳','素','云','莲','真','环','雪','荣','爱','妹','霞','香','月','莺','媛','艳','瑞','凡','琼','桂', \
        '娣','璧','梦'
    )
    # 女孩们的双名
    girls_given_words2 = ( \
        '倩雪','美琳','欢馨','优璇','雨嘉','娅楠','明美','诗涵','黛滢','嫦曦', \
        '静香','凌薇','雅静','雪丽','依娜','婉玗','书怡','诗茵','灵静','睿婕','婉婷'
    )

    # 随机生成名的字数 1-2
    given_name_num = random.randint(1, 2)

    # 第二种方法： 直接用 sample
    # 男孩的话选用 男字库
    if is_boy == 1:
        # 80% 选用单字双组合， 20% 选用双字
        if random.random() > 0.2:
            picked_word = random.sample(boys_given_words1, given_name_num)
        else:
            picked_word = random.sample(boys_given_words2, 1)
    else:
        # 90% 选用单字双组合， 10% 选用双字
        if random.random() > 0.1:
            picked_word = random.sample(girls_given_words1, given_name_num)
        else:
            picked_word = random.sample(girls_given_words2, 1)

    picked_name =""
    for word in picked_word:
        picked_name += word

    return picked_name

# -------------  调用函数 ---------------------------
#定义选取次数
"""
pick_times = 5
print("选取 (%d) 个男生的名，分别是：" %(pick_times), end="")
for i in range(pick_times):
    print("%s " % (pick_given_name(1)), end="")

print("\n")
print("选取 (%d) 个女生的名，分别是：" %(pick_times), end="")
for i in range(pick_times):
    print("%s " % (pick_given_name(2)), end="")
"""
